# 1. 그로스 해킹이란?
- 성공이 아닌 성장이 목적
- 고객의 취향이 세분화됨, 제품이 성공할지 확신하기 어려움, 유행과 트렌드의 변화 속도가 빠름 등의 이유로 많은 시간과 노력을 투자해서 만든 제품이 알고보니 아무도 원하지 않는 제품이라는 점을 뒤늦게 발견하게 됨(모든 경우는 아니지만 마켓팅에 어려움을 겪는 대부분의 서비스가)

## 1.1 린 스타트업
### 1.1.1 극심한 불확실성 속에서 새로운 제품과 서비스를 만드는 ‘제품 개발 방법론’을 제안
### 1.1.2 제품 개발 방법론
아이디어-개발-측정-개선의 피드백 순환고리를 최대한 빠르게 진행, 점진적 개선

## 1.2 그로스 해킹의 사례
### 1.2.1 핫메일
이메일 하단에 ‘추신: 당신을 사랑합니다. 핫메일에서 무료 이메일 계정을 받으세요’ 안내 문구 추가
### 1.2.2 에어비앤비
숙소 사진 퀄리티 향상
### 1.2.3 드롭박스
‘무료로 공간을 확장하세요’ 버튼을 서비스 화면에 추가

## 1.3 그로스 해킹 학습의 어려움
### 1.3.1
책으로 공부하면 진도가 안 나가고, 강의로 공부하면 ‘그래서 내 서비스에서는 뭘 해야 하지?’와 같은 의문이 생김

## 1.4 그로스 해킹 필수 개념
### 1.4.1 크로스펑셔널 팀
여러 직군간 협업
### 1.4.2 린 스타트업
제품 개발-지표 측정-학습 및 개선 사이클을 빠르게 반복
### 1.4.3 최소 기능 제품
기능을 이것저것 추가하기 보다는 기획자가 문제를 해결하기 위해 세웠던 가설을 검증할 수 있는 최소한의 기능만이 포함되어야 함. 그 외의 추가기능은 고객의 피드백을 수용하는 방향이 적절.
### 1.4.4 AARRR(지표 관리 방법론)
고객 유치, 활성화, 리텐션, 수익화, 추천의 다섯 범주에 따라 주요 지표를 모니터링 및 관리 해야함
### 1.4.5 정리
그로스 해킹이란 크로스펑셔널한 직군의 멤버들이 모여서 핵심 지표를 중심으로 실험을 통해 배움을 얻고, 이를 빠르게 반복하며 제품이나 서비스를 성장시키는 것.
### 1.4.6 그로스 해킹의 주요 범주
지표, 분석 환경, 프로세스, 문화

# 2. 전제조건: Product-Market Fit

## 2.1 Product-Market Fit을 이해하지 못한다면?
### 2.1.1 서비스 출시 과정
아이디어가 떠오름 – 멤버를 모아 제품 제작 – 작은 문제로 인해 출시 일정이 약간 늦춰졌지만 출시함 – 사용자들에게 관심을 못받음 – 홍보 – 잠시 사용자가 늘었다 다시 줄음 – 큰 비용을 사용하여 홍보 – 잠시 사용자가 늘었다 다시 줄음 – 여기서 뭘 더 어떻게 해야하지?
### 2.1.2
기능을 추가하여 완성도를 높이는 것은 가장 안좋은 선택

## 2.2 제품 관리자의 대표적 실수
### 2.2.1
제품을 먼저 만들고, 그 다음에 고객을 찾음
### 2.2.2
서비스를 기획할 때 보고서의 논리성에 지나치게 집중하게 됨  
→ 상위 의사결정권자의 허가는 받을 수 있을지 몰라도  
→ 논리가 사용자를 설득하진 않음  
→ 논리에 함몰되는 것은 좋지 않음
### 2.2.3 기능을 무한추가
- 사용자가 어떤 기능을 원하는지도 모름
- 기능이 추가되는 만큼 서비스 복잡도는 높아지고 자연스럽게 레거시가 늘어남
- 기능이 많은 제품이 성공하는 게 아니라 최소한의 기능으로 사용자에게 가치를 전달할 수 있는 제품이 성공한다.

## 2.3 Product-Market Fit
### 2.3.1 의미
좋은 시장에, 그 시장을 만족시킬 수 있는 제품을 갖고 있는 것
### 2.3.2
우리가 만든 제품이나 서비스가 그로스 해킹을 할 만한 가치가 있는가?라는 질문에 답하는 과정
### 2.3.3
뭐가 문제인지를 모르는 문제에 당면했을 때 필요함
- 우리가 만든 제품이 처음 생각한 문제를 해결했는가?
- 이 제품을 통해 검증하려고 했던 가설이 무엇이고, 그 가설이 검증됐는가?
- 즉, 이 제품이 얼마나 가치를 가지는지 확인할 수 있는 지표

## 2.4 Product-Market Fit 확인 지표
### 2.4.1 리텐션
- 특정 서비스에 얼마나 꾸준히 남아서 활동하는지를 보여줌
- 그래프의 기울기가 완만해지면서 리텐션이 안정적으로 유지되는지, 혹은 꾸준히 우하향하는지
- 상위 랭킹 앱일수록 리텐션이 완만해지는 지점이 높음
- 온보딩 과정이 매우 중요
- 카테고리를 감안해서 지표의 건전성을 판단하는 것이 중요
### 2.4.2 전환율
- 한 단계에서 다음 단계로 넘어가는 사용자의 비율을 의미
- 가입/주요이벤트의 전환율을 보면 Product-Market Fit을 얼마나 만족하는지 판단 가능
- 단계가 거듭될수록 이탈 사용자가 많아짐 → 전환 퍼널은 역삼각형 모양
- 카테고리, 유입트래픽 등의 변수에 따라 전환율의 차이가 있으므로 전환율 수치보다 시간의 흐름에 따른 전환율의 변화 추이를 보는 것이 더 유용
### 2.4.3 순수 추천 지수(NPS)
- 이 서비스를 지인이나 친구에게 얼마나 추천하고 싶은가?
- 0점-10점, 11점 리커트 척도
- 3개의 그룹으로 나뉨: 적극적 추천 그룹(9-10), 소극적 추천 그룹(7-8), 비추천그룹(0-6)
- 순수추천지수 = (적극적 추천 그룹 – 비추천 그룹)/(전체 응답자)
- -1과 1 사이의 값
- NPS>0이라면 일반적으로 양호하다고 판단
- 팬에 대한 지표
- 불만족 고객을 줄이는 것만큼 팬층을 확보하는 게 중요
### 2.4.4 Product-Market Fit 개선 방향
- 지양해야 하는 것: 브레인스토밍, 기능추가, 잔존율/전환율 개선 실험
- 해야 하는 것: 사용자 대면 인터뷰(1:1 인터뷰 방식이 효과적), 사용자 행동 데이터 분석
- 즉 사용자에 대한 이해가 가장 중요
- 사용자 대면 1:1 인터뷰 주요 내용: 미래가 아닌 과거와 현재에 대한 질문, 가정이 아닌 경험을 질문, 결과가 아닌 과정을 볼 것, 기억이 아닌 습관을 통해 드러난 구체적 경험을 확인, 일반화된 진술이 아닌 개인의 경험이 드러날 수 있도록 할 것, 편향된 믿음을 확인하는 과정이 아닌 순수한 호기심으로 접근

